# SetMaxRangeToUnlimited Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalDemandFactorValue..::..SetMaxRangeToUnlimited Method
ElectricalDemandFactorValue Class See Also
---
Sets the max range on the value to unlimited
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public void SetMaxRangeToUnlimited()
```

Visual Basic
---
```text
Public Sub SetMaxRangeToUnlimited
```

Visual C++
---
```text
public:
void SetMaxRangeToUnlimited()
```

# See Also
ElectricalDemandFactorValue Class
Autodesk.Revit.DB.Electrical Namespace